/*****************************************************************/
/*****************************************************************/
/**update**20160328** *****************************************/
/**取消手动输入定位参数：实际监控区域的长和宽************************************/
/**改为从pose文件中读入***与fov操作方法一致**************************************/
/**休整协同定位，现在可以在无人机视口中找到匹配的目标标号，以白色序号标注****************************/
/**修复协同定位的部分bug*********************************************/
/**地形和fov参数将显示在定位界面上，以蓝色字体表述************************/
/*****************************************************************/
/**待修复的问题****读取文件类型，改为唯一类型，将pose文件后缀改为pos*************************/
/**3dvia 配套插件需要修改*************************************************/
/*可以更新版本号到v0.8a
*/
/*
update  20160329
修复关联编号不归0的问题，
在DA中CTrace维护了一个static变量增加编号排序，
现在删除CDA后将归0，
故应用到CDA类的所有类都应在clear时都应重新生成CDA
*/
#include "GUI/mainwindow.h"
#include <QtWidgets/QApplication>
#include <QTranslator>
int main(int argc, char *argv[])
{
	QApplication a(argc, argv);
	QTranslator simplified_CHN;
	simplified_CHN.load(".\\Language\\simplified_zh.qm");//绝对路径需要修改
	a.installTranslator(&simplified_CHN);
	MainWindow w;
	w.show();
	return a.exec();
}
